In [1]:
import numpy as np
import pandas as pd

In [3]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
dates = pd.date_range('20130101',periods = 6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
df = pd.DataFrame(np.random.randn(6,4),index=dates,columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.217813 -0.053363 -1.953216 -1.270313
2013-01-02  0.385566 -0.655607  0.317294 -0.011357
2013-01-03  0.273051  0.485990 -0.179910 -0.210504
2013-01-04  0.429143 -0.045922 -0.559615  0.282319
2013-01-05  0.313422 -0.484497 -0.329273  1.725192
2013-01-06  1.332965 -0.442230 -1.247677  0.716383

In [10]:
df2 = pd.DataFrame({'A': 1.,
                       'B': pd.Timestamp('20130102'),
                       'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                       'D': np.array([3] * 4, dtype='int32'),
                       'E': pd.Categorical(["test", "train", "test", "train"]),
                       'F': 'foo'})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [12]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [15]:
df.head(3)

                   A         B         C         D
2013-01-01 -0.217813 -0.053363 -1.953216 -1.270313
2013-01-02  0.385566 -0.655607  0.317294 -0.011357
2013-01-03  0.273051  0.485990 -0.179910 -0.210504

In [16]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.429143 -0.045922 -0.559615  0.282319
2013-01-05  0.313422 -0.484497 -0.329273  1.725192
2013-01-06  1.332965 -0.442230 -1.247677  0.716383

In [17]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [18]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [19]:
df_array = df.to_numpy()

In [20]:
df_array

array([[-0.21781251, -0.05336257, -1.95321598, -1.27031299],
       [ 0.38556568, -0.65560672,  0.31729417, -0.01135703],
       [ 0.27305145,  0.48599   , -0.17991048, -0.21050386],
       [ 0.42914273, -0.04592188, -0.55961525,  0.28231869],
       [ 0.3134217 , -0.48449671, -0.3292729 ,  1.72519179],
       [ 1.3329651 , -0.44222959, -1.24767661,  0.71638312]])

In [21]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.419389 -0.199271 -0.658733  0.205287
std    0.504882  0.415455  0.815207  0.997444
min   -0.217813 -0.655607 -1.953216 -1.270313
25%    0.283144 -0.473930 -1.075661 -0.160717
50%    0.349494 -0.247796 -0.444444  0.135481
75%    0.418248 -0.047782 -0.217251  0.607867
max    1.332965  0.485990  0.317294  1.725192

In [22]:
df

                   A         B         C         D
2013-01-01 -0.217813 -0.053363 -1.953216 -1.270313
2013-01-02  0.385566 -0.655607  0.317294 -0.011357
2013-01-03  0.273051  0.485990 -0.179910 -0.210504
2013-01-04  0.429143 -0.045922 -0.559615  0.282319
2013-01-05  0.313422 -0.484497 -0.329273  1.725192
2013-01-06  1.332965 -0.442230 -1.247677  0.716383

In [24]:
df_transpose = df.T
df_transpose

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.217813    0.385566    0.273051    0.429143    0.313422    1.332965
B   -0.053363   -0.655607    0.485990   -0.045922   -0.484497   -0.442230
C   -1.953216    0.317294   -0.179910   -0.559615   -0.329273   -1.247677
D   -1.270313   -0.011357   -0.210504    0.282319    1.725192    0.716383

In [31]:
df_transpose.sort_index(axis=1, ascending=False)

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.217813    0.385566    0.273051    0.429143    0.313422    1.332965
B   -0.053363   -0.655607    0.485990   -0.045922   -0.484497   -0.442230
C   -1.953216    0.317294   -0.179910   -0.559615   -0.329273   -1.247677
D   -1.270313   -0.011357   -0.210504    0.282319    1.725192    0.716383

In [32]:
df_transpose.sort_index(axis=1)

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.217813    0.385566    0.273051    0.429143    0.313422    1.332965
B   -0.053363   -0.655607    0.485990   -0.045922   -0.484497   -0.442230
C   -1.953216    0.317294   -0.179910   -0.559615   -0.329273   -1.247677
D   -1.270313   -0.011357   -0.210504    0.282319    1.725192    0.716383

In [36]:
df_transpose.sort_values(by='B',axis=1)

   2013-01-02  2013-01-05  2013-01-06  2013-01-01  2013-01-04  2013-01-03
A    0.385566    0.313422    1.332965   -0.217813    0.429143    0.273051
B   -0.655607   -0.484497   -0.442230   -0.053363   -0.045922    0.485990
C    0.317294   -0.329273   -1.247677   -1.953216   -0.559615   -0.179910
D   -0.011357    1.725192    0.716383   -1.270313    0.282319   -0.210504

In [37]:
df

                   A         B         C         D
2013-01-01 -0.217813 -0.053363 -1.953216 -1.270313
2013-01-02  0.385566 -0.655607  0.317294 -0.011357
2013-01-03  0.273051  0.485990 -0.179910 -0.210504
2013-01-04  0.429143 -0.045922 -0.559615  0.282319
2013-01-05  0.313422 -0.484497 -0.329273  1.725192
2013-01-06  1.332965 -0.442230 -1.247677  0.716383

In [38]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-02  0.385566 -0.655607  0.317294 -0.011357
2013-01-05  0.313422 -0.484497 -0.329273  1.725192
2013-01-06  1.332965 -0.442230 -1.247677  0.716383
2013-01-01 -0.217813 -0.053363 -1.953216 -1.270313
2013-01-04  0.429143 -0.045922 -0.559615  0.282319
2013-01-03  0.273051  0.485990 -0.179910 -0.210504

<h1>Pandas Filtering</h1>

In [76]:
dates = pd.date_range('20130101', periods=6)
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

In [42]:
df2 = pd.DataFrame({'A': 1.,
                        'B': pd.Timestamp('20130102'),
                        'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                        'D': np.array([3] * 4, dtype='int32'),
                        'E': pd.Categorical(["test", "train", "test", "train"]),
                        'F': 'foo'})

In [44]:
df

                   A         B         C         D
2013-01-01  1.480999 -2.619487 -0.042984 -0.784633
2013-01-02  0.730970  1.096479  0.583760 -1.531494
2013-01-03 -0.287761  1.178416  0.539436  0.936380
2013-01-04 -0.241908 -0.335842 -1.000154  1.256613
2013-01-05 -1.842533 -0.059061 -0.179525 -0.325134
2013-01-06  0.645277  0.952473 -0.610133 -0.498122

In [45]:
df['A']

2013-01-01    1.480999
2013-01-02    0.730970
2013-01-03   -0.287761
2013-01-04   -0.241908
2013-01-05   -1.842533
2013-01-06    0.645277
Freq: D, Name: A, dtype: float64

In [46]:
df.A

2013-01-01    1.480999
2013-01-02    0.730970
2013-01-03   -0.287761
2013-01-04   -0.241908
2013-01-05   -1.842533
2013-01-06    0.645277
Freq: D, Name: A, dtype: float64

In [47]:
df[0:3]

                   A         B         C         D
2013-01-01  1.480999 -2.619487 -0.042984 -0.784633
2013-01-02  0.730970  1.096479  0.583760 -1.531494
2013-01-03 -0.287761  1.178416  0.539436  0.936380

In [50]:
df['2013-01-02':'2013-01-04']

                   A         B         C         D
2013-01-02  0.730970  1.096479  0.583760 -1.531494
2013-01-03 -0.287761  1.178416  0.539436  0.936380
2013-01-04 -0.241908 -0.335842 -1.000154  1.256613

In [49]:
df.loc['2013-01-02']

A    0.730970
B    1.096479
C    0.583760
D   -1.531494
Name: 2013-01-02 00:00:00, dtype: float64

In [57]:
df.loc['2013-01-02':'2013-01-05',['A','B']]

                   A         B
2013-01-02  0.730970  1.096479
2013-01-03 -0.287761  1.178416
2013-01-04 -0.241908 -0.335842
2013-01-05 -1.842533 -0.059061

In [58]:
df.loc['20130102', ['A', 'B']]

A    0.730970
B    1.096479
Name: 2013-01-02 00:00:00, dtype: float64

In [60]:
df.loc[dates[1], 'A']

0.730970349673242

In [62]:
df

                   A         B         C         D
2013-01-01  1.480999 -2.619487 -0.042984 -0.784633
2013-01-02  0.730970  1.096479  0.583760 -1.531494
2013-01-03 -0.287761  1.178416  0.539436  0.936380
2013-01-04 -0.241908 -0.335842 -1.000154  1.256613
2013-01-05 -1.842533 -0.059061 -0.179525 -0.325134
2013-01-06  0.645277  0.952473 -0.610133 -0.498122

In [63]:
df.iloc[3]

A   -0.241908
B   -0.335842
C   -1.000154
D    1.256613
Name: 2013-01-04 00:00:00, dtype: float64

In [65]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -0.241908 -0.335842
2013-01-05 -1.842533 -0.059061

In [67]:
df.iloc[:,:3]

                   A         B         C
2013-01-01  1.480999 -2.619487 -0.042984
2013-01-02  0.730970  1.096479  0.583760
2013-01-03 -0.287761  1.178416  0.539436
2013-01-04 -0.241908 -0.335842 -1.000154
2013-01-05 -1.842533 -0.059061 -0.179525
2013-01-06  0.645277  0.952473 -0.610133

In [77]:
df_new = pd.DataFrame({'string': list('abc'),
                       'int64': list(range(1, 4)),
                       'uint8': np.arange(3, 6).astype('u1'),
                       'float64': np.arange(4.0, 7.0),
                       'bool1': [True, False, True],
                       'bool2': [False, True, False],
                       'dates': pd.date_range('now', periods=3),
                       'category': pd.Series(list("ABC")).astype('category')})

In [78]:
df_new

,string,int64,uint8,float64,bool1,bool2,dates,category
0,a,1,3,4.0,True,False,2020-09-22 14:05:49.879676,A
1,b,2,4,5.0,False,True,2020-09-23 14:05:49.879676,B
2,c,3,5,6.0,True,False,2020-09-24 14:05:49.879676,C

In [69]:
df.select_dtypes(include=[bool])

   bool1  bool2
0   True  False
1  False   True
2   True  False

In [86]:
df[df['A'] > 0]

                   A         B         C         D
2013-01-01  1.954909 -0.897876  0.052587  0.711904
2013-01-02  0.195624  0.391661  0.373584 -1.271750
2013-01-03  0.352793  0.683124 -2.085927 -1.387819
2013-01-04  0.650581 -1.476161 -0.203753 -0.168151
2013-01-06  0.817408  0.176051  0.905608  0.560025

In [88]:
df2 = df.copy()

In [90]:
df2['E'] = ['one','one','two','three','four','three']

In [93]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03  0.352793  0.683124 -2.085927 -1.387819   two
2013-01-05 -0.280207  0.018432  0.118539 -0.793443  four

In [98]:
df.loc[:, 'D'] = np.array([5] * len(df))

In [96]:
df

                   A         B         C  D
2013-01-01  1.954909 -0.897876  0.052587  5
2013-01-02  0.195624  0.391661  0.373584  5
2013-01-03  0.352793  0.683124 -2.085927  5
2013-01-04  0.650581 -1.476161 -0.203753  5
2013-01-05 -0.280207  0.018432  0.118539  5
2013-01-06  0.817408  0.176051  0.905608  5